doom/config.org
#+title: Config
#+PROPERTY: tangle yes

* Table of Content :toc:
- [[#doom-settings][Doom Settings]]
- [[#keybinding][Keybinding]]
  - [[#comment-line][Comment Line]]
- [[#markdown][Markdown]]
  - [[#headers][Headers]]
  - [[#toggle-markdown-view][Toggle Markdown View]]
- [[#org][Org]]
  - [[#org-roam][Org-Roam]]
  - [[#headers-1][Headers]]
- [[#nubank-config][Nubank Config]]
  - [[#project-search-directory][Project Search Directory]]
  - [[#custom-tools][Custom Tools]]

* Doom Settings

Global Doom Emacs settings. Sets the theme to `doom-tokyo-night`, font to `JetBrains Mono` size 15, relative line numbers, disables the kill-emacs confirmation prompt, and maps the `localleader` key to `,.`

#+begin_src emacs-lisp
(setq doom-theme 'doom-tokyo-night)
(setq doom-font (font-spec :family "JetBrains Mono" :size 15))
(setq display-line-numbers-type 'relative)
(setq confirm-kill-emacs nil)
(setq doom-localleader-key ",")

#+end_src

* Keybinding

** Comment Line

Maps `SPC -` to comment/uncomment the current line using `comment-line`.

#+begin_src emacs-lisp
(map! :leader
      :desc "Comment line" "-" #'comment-line)

#+end_src

* Markdown

** Headers

Visually customizes Markdown headers using the `variable-pitch` font family, bold weight, and decreasing heights from `1.6` (H1) down to `1.1` (H6), all inheriting from `font-lock-function-name-face`.

#+begin_src emacs-lisp
(custom-set-faces
 '(markdown-header-face ((t (:inherit font-lock-function-name-face :weight bold :family "variable-pitch"))))
 '(markdown-header-face-1 ((t (:inherit markdown-header-face :height 1.6))))
 '(markdown-header-face-2 ((t (:inherit markdown-header-face :height 1.5))))
 '(markdown-header-face-3 ((t (:inherit markdown-header-face :height 1.4))))
 '(markdown-header-face-4 ((t (:inherit markdown-header-face :height 1.3))))
 '(markdown-header-face-5 ((t (:inherit markdown-header-face :height 1.2))))
 '(markdown-header-face-6 ((t (:inherit markdown-header-face :height 1.1)))))

#+end_src

** Toggle Markdown View

Defines an interactive function that toggles between `markdown-mode` (editing) and `markdown-view-mode` (read-only preview). Useful for checking the document's rendered appearance without leaving the buffer.

#+begin_src emacs-lisp
(defun mrbarboza/toggle-markdown-view-mode ()
  "Toggle between `markdown-mode' and `markdown-view-mode'."
  (interactive)
  (if (eq major-mode 'markdown-view-mode)
      (markdown-mode)
    (markdown-view-mode)))

#+end_src

* Org

** Org-Roam

Define the `~/vault/` directory as the Org-Roam directory, enables database autosync, shows tags in the node-find completion UI, and enables inline link insertion anywhere.

#+begin_src emacs-lisp
(setq org-roam-directory "~/vault/"
      org-roam-dailies-directory "daily/")

(after! org-roam
  (org-roam-db-autosync-mode)
  (setq org-roam-node-display-template
        (concat "${title:*} " (propertize "${tags:20}" 'face 'org-tag)))
  (setq org-roam-completion-everywhere t))
#+end_src

Enginering Manager capture templates: fleeting (inbox), person (direct reports/stakeholders), 1-on-1, meeting, decision log, feedback, reading, project, and structure (MOC). People and project notes live in their own subdirectories; everything else is flat in `~/vault/` with timestamp-prefixed filenames.

#+begin_src emacs-lisp
(setq org-roam-capture-templates
  '(("f" "fleeting" plain
     "%?"
     :target (file+head "inbox/%<%Y%m%d%H%M%S>-${slug}.org"
              "#+title: ${title}\n#+filetags: :fleeting:\n#+date: %T\n\n")
     :unnarrowed t)

    ("p" "person" plain
     "* Role\n%?\n\n* Strengths\n\n* Growth Areas\n\n* Career Goals\n\n* Notes"
     :target (file+head "people/%<%Y%m%d%H%M%S>-${slug}.org"
              "#+title: ${title}\n#+filetags: :person:\n#+date: %T\n\n")
     :unnarrowed t)

    ("o" "1-on-1" plain
     "* Date: %<%Y-%m-%d>\n\n* Agenda\n%?\n\n* Updates\n\n* Action Items\n\n* Notes"
     :target (file+head "1on1/%<%Y%m%d%H%M%S>-${slug}.org"
              "#+title: ${title}\n#+filetags: :1on1:\n#+date: %T\n\n")
     :unnarrowed t)

    ("m" "meeting" plain
     "* Attendees\n%?\n\n* Agenda\n\n* Discussion\n\n* Decisions\n\n* Action Items"
     :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
              "#+title: ${title}\n#+filetags: :meeting:\n#+date: %T\n\n")
     :unnarrowed t)

    ("d" "decision" plain
     "* Context\n%?\n\n* Options Considered\n\n* Decision\n\n* Rationale\n\n* Consequences"
     :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
              "#+title: ${title}\n#+filetags: :decision:\n#+date: %T\n\n")
     :unnarrowed t)

    ("k" "feedback" plain
     "* Person\n%?\n\n* Context\n\n* Observation\n\n* Impact\n\n* Ask / Suggestion"
     :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
              "#+title: ${title}\n#+filetags: :feedback:\n#+date: %T\n\n")
     :unnarrowed t)

    ("j" "project" plain
     "* Goal\n%?\n\n* Status\n\n* Team\n\n* Key Decisions\n\n* Risks\n\n* Updates"
     :target (file+head "projects/%<%Y%m%d%H%M%S>-${slug}.org"
              "#+title: ${title}\n#+filetags: :project:\n#+date: %T\n\n")
     :unnarrowed t)

    ("s" "structure (MOC)" plain
     "* Overview\n%?\n\n* Index\n\n* Related Structures"
     :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
              "#+title: ${title}\n#+filetags: :structure:\n#+date: %T\n\n")
     :unnarrowed t)))

(setq org-roam-dailies-capture-templates
  '(("d" "default" plain
     "* Focus\n%?\n\n* Meetings\n\n* Action Items\n\n* Notes"
     :target (file+head "%<%Y-%m-%d>.org"
              "#+title: %<%Y-%m-%d>\n#+filetags: :daily:\n\n"))))
#+end_src

Opens `~/vault/inbox/` via `SPC n r I`, `~/vault/people/` via `SPC n r P`, and `~/vault/1on1/` via `SPC n r O`.

#+begin_src emacs-lisp
(map! :leader
      :desc "Open inbox in dired"   "n r I" #'(lambda () (interactive) (dired "~/vault/inbox/"))
      :desc "Open people in dired"  "n r P" #'(lambda () (interactive) (dired "~/vault/people/"))
      :desc "Open 1-on-1s in dired" "n r O" #'(lambda () (interactive) (dired "~/vault/1on1/")))
#+end_src

Defining `org-roam-ui`

#+begin_src emacs-lisp
(use-package! org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start nil))
#+end_src

Defining full-text search

#+begin_src emacs-lisp
(use-package! consult-org-roam
  :after org-roam
  :config
  (consult-org-roam-mode 1)
  :bind
  (:map doom-leader-notes-map
   ("r s" . consult-org-roam-search)     ; SPC n r s — full-text search
   ("r B" . consult-org-roam-backlinks))) ; SPC n r B — backlinks via consult
#+end_src

Defining *inline* highlight with backticks (*`*)

#+begin_src emacs-lisp
(after! org
  ;; Add backtick as inline code marker (like Markdown)
  (add-to-list 'org-emphasis-alist
               '("`" (:inherit font-lock-constant-face :foreground "#b16286")))
  (setcar (nthcdr 2 org-emphasis-regexp-components) " \t\r\n,\"')}")
  (org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components))

#+end_src 

** Headers

Customizes Org heading faces specifically for the `doom-tokyo-night` theme, with heights decreasing from `1.6` (level 1) to `1.0` (levels 7 and 8), and the document title at `1.8` with bold and no underline.

#+begin_src emacs-lisp
(custom-theme-set-faces!
'doom-tokyo-night
'(org-level-8 :inherit outline-3 :height 1.0)
'(org-level-7 :inherit outline-3 :height 1.0)
'(org-level-6 :inherit outline-3 :height 1.1)
'(org-level-5 :inherit outline-3 :height 1.2)
'(org-level-4 :inherit outline-3 :height 1.3)
'(org-level-3 :inherit outline-3 :height 1.4)
'(org-level-2 :inherit outline-2 :height 1.5)
'(org-level-1 :inherit outline-1 :height 1.6)
'(org-document-title  :height 1.8 :bold t :underline nil))

#+end_src

* Nubank Config

Defines a constant holding the absolute path to `~/dev/nu`, used as the base for all Nubank-specific configurations below.

#+begin_src emacs-lisp
(defconst mrbarboza/nu-dir
  (expand-file-name "dev/nu" (getenv "HOME")))

#+end_src

#+RESULTS:
: mrbarboza/nu-dir

** Project Search Directory

Increases the process output buffer to 1MB (improves LSP performance), and — if `~/dev/nu` exists — configures Projectile to search for projects there and disables caching (likely because projects change frequently in Nubank's monorepo).

#+begin_src emacs-lisp
(setq read-process-output-max (* 1024 1024))
(when (file-directory-p mrbarboza/nu-dir)
  (setq projectile-project-search-path (list mrbarboza/nu-dir)
        projectile-enable-caching nil))

#+end_src

** Custom Tools

Configures `lsp-mode` with semantic tokens enabled and a hook that auto-saves the buffer after LSP applies edits (e.g. code actions, renames). Then conditionally loads the internal `nu` package from `nudev` — Nubank's internal dev tooling — if the path exists on disk.

#+begin_src emacs-lisp
(use-package! lsp-mode
  :commands lsp
  :config
  (setq lsp-semantic-tokens-enable t)
  (add-hook 'lsp-after-apply-edits-hook
            (lambda (&rest _)
              (save-buffer))))

(let ((nudev-emacs-path (expand-file-name "nudev/ides/emacs/" mrbarboza/nu-dir)))
  (when (file-directory-p nudev-emacs-path)
    (add-to-list 'load-path nudev-emacs-path)
    (require 'nu nil t)))

#+end_src
